src/main/test/artillery/first_post.yaml
config:
    target: http://127.0.0.1:8080/tukano/rest
    phases:
        - name: simple_post
          duration: 1
          arrivalRate: 3
    payload:
        path: ./data/blobs.csv
        order: sequence # selects users sequentially, default is random
        #loadAll: true # load the whole CSV
        skipHeader: true # The first line is a header, so we want to skip it
        delimiter: "," # standard delimiter
        skipEmptyLines: true # not important in our case
        fields:
            - "blobId"
            - "bytes"
            - "token"
scenarios:
    - name: TuKanoRegister
      flow:
        - post:
            url: /blobs/{{ blobId }}?token={{ token }}
            headers:
                Content-Type: application/octet-stream
                body: "{{ bytes }}"