src/main/test/artillery/output_log.txt
Test run id: tkfq9_zwzmg6ze789985hn9qk8n3zf9rpa4_4x6r
Phase started: post_csv_users (index: 0, duration: 25s) 18:46:23(+0000)

* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
* POST /tukano/rest/users/ 

  ok statusCode 200 
* POST /tukano/rest/users/ 

  ok statusCode 409 
--------------------------------------
Metrics for period to: 18:46:30(+0000) (width: 5.019s)
--------------------------------------

http.codes.200: ................................................................ 6
http.codes.409: ................................................................ 6
http.downloaded_bytes: ......................................................... 30
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 12
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 7
  mean: ........................................................................ 5.6
  median: ...................................................................... 5
  p95: ......................................................................... 7
  p99: ......................................................................... 7
http.response_time.2xx:
  min: ......................................................................... 5
  max: ......................................................................... 7
  mean: ........................................................................ 5.8
  median: ...................................................................... 5
  p95: ......................................................................... 7
  p99: ......................................................................... 7
http.response_time.4xx:
  min: ......................................................................... 4
  max: ......................................................................... 6
  mean: ........................................................................ 5.3
  median: ...................................................................... 5
  p95: ......................................................................... 6
  p99: ......................................................................... 6
http.responses: ................................................................ 12
plugins.expect.ok: ............................................................. 12
plugins.expect.ok.statusCode: .................................................. 12
plugins.metrics-by-endpoint./tukano/rest/users/.codes.200: ..................... 6
plugins.metrics-by-endpoint./tukano/rest/users/.codes.409: ..................... 6
plugins.metrics-by-endpoint.response_time./tukano/rest/users/:
  min: ......................................................................... 4
  max: ......................................................................... 7
  mean: ........................................................................ 5.6
  median: ...................................................................... 5
  p95: ......................................................................... 7
  p99: ......................................................................... 7
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 6
vusers.created_by_name.TuKanoRegister: ......................................... 6
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20.2
  max: ......................................................................... 53.7
  mean: ........................................................................ 28.2
  median: ...................................................................... 22.4
  p95: ......................................................................... 27.4
  p99: ......................................................................... 27.4